## Plan Result (sbox)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 2 to change, 3 to destroy.</code></pre>

* Create
  * azurerm_storage_account.stg
  * azurerm_storage_share.share[0]
  * azurerm_storage_share.share[1]
  * module.azurekeyvault.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;01e164a6-001f-406f-9708-07e540cbe0e7&#34;]
* Update
  * azurerm_key_vault_secret.kvs
  * module.azurekeyvault.azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * module.azurekeyvault.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;1c1c7ac9-fab4-4b11-ab9a-29e14336f15d&#34;]
* Replace
  * azurerm_key_vault_access_policy.cftapps_kv_access_policy
  * azurerm_key_vault_access_policy.managed_identity_access_policy




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_access_policy.cftapps_kv_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "cftapps_kv_access_policy" {
      ~ id                      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/core-infra-sbox-rg/providers/Microsoft.KeyVault/vaults/cftapps-sbox/objectId/1c1c7ac9-fab4-4b11-ab9a-29e14336f15d" -> (known after apply)
      ~ object_id               = "1c1c7ac9-fab4-4b11-ab9a-29e14336f15d" -> "01e164a6-001f-406f-9708-07e540cbe0e7" # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_access_policy.managed_identity_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      ~ id                      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-neuvector-sbox-rg/providers/Microsoft.KeyVault/vaults/cftneuvector-sbox/objectId/1c1c7ac9-fab4-4b11-ab9a-29e14336f15d" -> (known after apply)
      ~ object_id               = "1c1c7ac9-fab4-4b11-ab9a-29e14336f15d" -> "01e164a6-001f-406f-9708-07e540cbe0e7" # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.kvs will be updated in-place
  ~ resource "azurerm_key_vault_secret" "kvs" {
        id                      = "https://cftneuvector-sbox.vault.azure.net/secrets/storage-account-key/edd03e2e7eee4afeb62603fceb8beaa4"
        name                    = "storage-account-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_account.stg will be created
  + resource "azurerm_storage_account" "stg" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = "cftneuvectorsbox"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "cft-neuvector-sbox-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/cft-neuvector"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
    }

  # azurerm_storage_share.share[0] will be created
  + resource "azurerm_storage_share" "share" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "neuvector-data-00"
      + quota                = 1
      + resource_manager_id  = (known after apply)
      + storage_account_name = "cftneuvectorsbox"
      + url                  = (known after apply)
    }

  # azurerm_storage_share.share[1] will be created
  + resource "azurerm_storage_share" "share" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "neuvector-data-01"
      + quota                = 1
      + resource_manager_id  = (known after apply)
      + storage_account_name = "cftneuvectorsbox"
      + url                  = (known after apply)
    }

  # module.azurekeyvault.azurerm_key_vault_access_policy.managed_identity_access_policy["01e164a6-001f-406f-9708-07e540cbe0e7"] will be created
  + resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-neuvector-sbox-rg/providers/Microsoft.KeyVault/vaults/cftneuvector-sbox"
      + object_id               = "01e164a6-001f-406f-9708-07e540cbe0e7"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.azurekeyvault.azurerm_key_vault_access_policy.managed_identity_access_policy["1c1c7ac9-fab4-4b11-ab9a-29e14336f15d"] will be destroyed
  # (because key ["1c1c7ac9-fab4-4b11-ab9a-29e14336f15d"] is not in for_each map)
  - resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      - certificate_permissions = [
          - "Get",
          - "List",
        ] -> null
      - id                      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-neuvector-sbox-rg/providers/Microsoft.KeyVault/vaults/cftneuvector-sbox/objectId/1c1c7ac9-fab4-4b11-ab9a-29e14336f15d" -> null
      - key_permissions         = [
          - "Get",
          - "List",
        ] -> null
      - key_vault_id            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-neuvector-sbox-rg/providers/Microsoft.KeyVault/vaults/cftneuvector-sbox" -> null
      - object_id               = "1c1c7ac9-fab4-4b11-ab9a-29e14336f15d" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.azurekeyvault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-neuvector-sbox-rg/providers/Microsoft.KeyVault/vaults/cftneuvector-sbox|cftneuvector-sbox"
        name                           = "cftneuvector-sbox"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 6 to add, 2 to change, 3 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_storage_account.stg has been deleted
  - resource "azurerm_storage_account" "stg" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-neuvector-sbox-rg/providers/Microsoft.Storage/storageAccounts/cftneuvectorsbox"
      - name                              = "cftneuvectorsbox" -> null
      - primary_access_key                = (sensitive value) -> null
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/cft-neuvector"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "2023-12-08"
            "startupMode"  = "always"
        }
        # (36 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":20,"Program":"tfcmt","SHA1":"","Target":"sbox","Vars":{}} -->